



IPv6 Maintenance                                              J. Linkova
Internet-Draft                                                    Google
Updates: 4861 (if approved)                           September 15, 2020
Intended status: Standards Track
Expires: March 19, 2021


Gratuitous Neighbor Discovery: Creating Neighbor Cache Entries on First-
                              Hop Routers
                        draft-ietf-6man-grand-03

Abstract

   Neighbor Discovery (RFC4861) is used by IPv6 nodes to determine the
   link-layer addresses of neighboring nodes as well as to discover and
   maintain reachability information.  This document updates RFC4861 to
   allow routers to proactively create a Neighbor Cache entry when a new
   IPv6 address is assigned to a node.  It also updates RFC4861 and
   recommends nodes to send unsolicited Neighbor Advertisements upon
   assigning a new IPv6 address.  The proposed change will minimize the
   delay and packet loss when a node initiate connections to off-link
   destination from a new IPv6 address.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on March 19, 2021.

Copyright Notice

   Copyright (c) 2020 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of



Linkova                  Expires March 19, 2021                 [Page 1]

Internet-Draft                Gratuitous ND               September 2020


   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
     1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   3
     1.2.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   4
   2.  Problem Statement . . . . . . . . . . . . . . . . . . . . . .   4
   3.  Solution Requirements . . . . . . . . . . . . . . . . . . . .   6
   4.  Proposed Changes to Neighbor Discovery  . . . . . . . . . . .   6
     4.1.  Nodes Sending Gratuitous Neighbor Advertisements  . . . .   6
     4.2.  Routers Creating Cache Entries Upon Receiving Unsolicited
           Neighbor Advertisements . . . . . . . . . . . . . . . . .   7
   5.  Avoiding Disruption . . . . . . . . . . . . . . . . . . . . .   8
     5.1.  Neighbor Cache Entry Exists in Any State Other That
           INCOMPLETE  . . . . . . . . . . . . . . . . . . . . . . .   8
     5.2.  Neighbor Cache Entry is in INCOMPLETE state . . . . . . .   8
     5.3.  Neighbor Cache Entry Does Not Exist . . . . . . . . . . .   9
       5.3.1.  The Rightful Owner Is Not Sending Packets From The
               Address . . . . . . . . . . . . . . . . . . . . . . .   9
       5.3.2.  The Rightful Owner Has Started Sending Packets From
               The Address . . . . . . . . . . . . . . . . . . . . .  10
   6.  Modifications to RFC-Mandated Behavior  . . . . . . . . . . .  11
     6.1.  Modification to RFC4861 Neighbor Discovery for IP version
           6 (IPv6)  . . . . . . . . . . . . . . . . . . . . . . . .  11
       6.1.1.  Modification to the section 7.2.5 . . . . . . . . . .  11
       6.1.2.  Modification to the section 7.2.6 . . . . . . . . . .  12
   7.  Solution Limitations  . . . . . . . . . . . . . . . . . . . .  13
   8.  Solutions Considered but Discarded  . . . . . . . . . . . . .  13
     8.1.  Do Nothing  . . . . . . . . . . . . . . . . . . . . . . .  14
     8.2.  Change to the Registration-Based Neighbor Discovery . . .  14
     8.3.  Host Sending NS to the Router Address from Its GUA  . . .  14
     8.4.  Host Sending Router Solicitation from its GUA . . . . . .  15
     8.5.  Routers Populating Their Caches by Gleaning From Neighbor
           Discovery Packets . . . . . . . . . . . . . . . . . . . .  16
     8.6.  Initiating Hosts-to-Routers Communication . . . . . . . .  16
     8.7.  Making the Probing Logic on Hosts More Robust . . . . . .  17
     8.8.  Increasing the Buffer Size on Routers . . . . . . . . . .  17
     8.9.  Transit Dataplane Traffic From a New Address Triggering
           Address Resolution  . . . . . . . . . . . . . . . . . . .  18
   9.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  18
   10. Security Considerations . . . . . . . . . . . . . . . . . . .  18
   11. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  19



Linkova                  Expires March 19, 2021                 [Page 2]

Internet-Draft                Gratuitous ND               September 2020


   12. References  . . . . . . . . . . . . . . . . . . . . . . . . .  19
     12.1.  Normative References . . . . . . . . . . . . . . . . . .  19
     12.2.  Informative References . . . . . . . . . . . . . . . . .  20
   Author's Address  . . . . . . . . . . . . . . . . . . . . . . . .  21

1.  Introduction

   The Neighbor Discovery state machine defined in [RFC4861] assumes
   that communications between IPv6 nodes are in most cases bi-
   directional and if a node A is trying to communicate to its neighbor,
   node B, the return traffic flows could be expected.  So when the node
   A starts the address resolution process, the target node B would also
   create an entry for A address in its neighbor cache.  That entry will
   be used for sending the return traffic to A.

   In particular, section 7.2.5 of [RFC4861] states: "When a valid
   Neighbor Advertisement is received (either solicited or unsolicited),
   the Neighbor Cache is searched for the target's entry.  If no entry
   exists, the advertisement SHOULD be silently discarded.  There is no
   need to create an entry if none exists, since the recipient has
   apparently not initiated any communication with the target."

   While this approach is perfectly suitable for host-to-host on-link
   communications, it does not work so well when a host sends traffic to
   off-link destinations.  After joining the network and receiving a
   Router Advertisement the host populates its neighbor cache with the
   default router IPv6 and link-layer addresses and is able to send
   traffic to off-link destinations.  At the same time the router does
   not have any cache entries for the host global addresses yet and only
   starts address resolution upon receiving the first packet of the
   return traffic flow.  While waiting for the resolution to complete
   routers only keep a very small number of packets in the queue, as
   recommended in Section 7.2.2 [RFC4861].  All subsequent packets
   arriving before the resolution process finishes are likely to be
   dropped.  It might cause user-visible packet loss and performance
   degradation.

1.1.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.







Linkova                  Expires March 19, 2021                 [Page 3]

Internet-Draft                Gratuitous ND               September 2020


1.2.  Terminology

   Node: a device that implements IP, [RFC4861].

   Host: any node that is not a router, [RFC4861].

   ND: Neighbor Discovery, [RFC4861].

   SLAAC: IPv6 Stateless Address Autoconfiguration, [RFC4862].

   NS: Neighbor Solicitation, [RFC4861].

   NA: Neighbor Advertisement, [RFC4861].

   RS: Router Solicitation, [RFC4861].

   RA: Router Advertisement, [RFC4861].

   SLLA: Source link-layer Address, an option in the ND packets
   containing the link-layer address of the sender of the packet
   [RFC4861].

   TLLA: Target link-layer Address, an option in the ND packets
   containing the link-layer address of the target [RFC4861].

   GUA: Global Unicast Address [RFC4291].

   DAD: Duplicate Address Detection, [RFC4862].

   Optimistic DAD: a modification of DAD, [RFC4429].

2.  Problem Statement

   The most typical scenario when the problem may arise is a host
   joining the network, forming a new address and using that address for
   accessing the Internet:

   1.  A host joins the network and receives a Router Advertisement (RA)
       packet from the first-hop router (either a periodic unsolicited
       RA or a response to a Router Solicitation sent by the host).  The
       RA contains information the host needs to perform SLAAC and to
       configure its network stack.  The RA is send from the router's
       link-local address to link-local destination and may contain the
       link-layer address of the router.  As a result the host can
       populate its Neighbor Cache with the router's link-local and
       link-layer addresses.





Linkova                  Expires March 19, 2021                 [Page 4]

Internet-Draft                Gratuitous ND               September 2020


   2.  The host starts opening connections to off-link destinations.  A
       very common use case is a mobile device sending probes to detect
       the Internet connectivity and/or the presence of a captive portal
       on the network.  To speed up that process many implementations
       use Optimistic DAD which allows them to send probes before the
       DAD process is completed.  At that moment the device neighbor
       cache contains all information required to send those probes
       (such as the default router link-local the link-layer addresses).
       The router neighbor cache, however, might contain an entry for
       the device link-local address (if the device has been performing
       the address resolution for the router link-local address), but
       there are no entries for the device global addresses.

   3.  Return traffic is received by the first-hop router.  As the
       router does not have any cache entry for the host global address
       yet, the router starts the neighbor discovery process by creating
       an INCOMPLETE cache entry and then sending a Neighbor
       Solicitation to the Solicited Node Multicast Address.  As per
       Section 7.2.2 of [RFC4861] Routers MUST buffer at least one data
       packet and MAY buffer more, while resolving the packet
       destination address.  However most router implementations limit
       the buffer size to a few packets only, so all subsequent packets
       for the host global address are dropped, until the address
       resolution process is completed.

   4.  If the host sends multiple probes in parallel, it would consider
       all but one of them failed.  That leads to user-visible delay in
       connecting to the network, especially if the host implements some
       form of backoff mechanism and does not retransmit the probes as
       soon as possible.

   This scenario illustrates the problem occurring when the device
   connects to the network for the first time or after an inactivity
   period long enough for the device address to be removed from the
   router's neighbor cache.  However, the same sequence of events happen
   when the host starts using a new global address previously unseen by
   the router, such as a new privacy address [RFC4941] or if the
   router's Neighbor Cache has been flushed.

   While in dual-stack networks this problem might be hidden by Happy
   Eyeballs [RFC8305] it manifests quite clearly in IPv6-only
   environments, especially wireless ones, leading to poor user
   experience and contributing to a negative perception of IPv6-only
   solutions as unstable and non-deployable.







Linkova                  Expires March 19, 2021                 [Page 5]

Internet-Draft                Gratuitous ND               September 2020


3.  Solution Requirements

   It would be highly desirable to improve the Neighbor Discovery
   mechanics so routers have a usable cache entry for a host address by
   the time the router receives the first packet for that address.  In
   particular:

   o  If the router does not have a Neighbor Cache entry for the
      address, a STALE entry needs to be created.

   o  The solution needs to work for Optimistic addresses as well.
      Devices implementing the Optimistic DAD usually attempt to
      minimize the delay in connecting to the network and therefore are
      more likely to be affected by the problem described in this
      document.

   o  In case of duplicate addresses present in the network, the
      proposed solution MUST NOT override the existing entry.

   o  In topologies with multiple first-hop routers the cache needs to
      be updated on all of them, as traffic might be asymmetric:
      outgoing flows leaving the network via one router while the return
      traffic enters the segment via another one.

   In addition the solution MUST NOT exacerbate issues described in
   [RFC6583] and MUST be compatible with the recommendations provided in
   [RFC6583].

4.  Proposed Changes to Neighbor Discovery

   The following changes are proposed to minimize the delay in creating
   new entries in a router neighbor cache

   o  A node sends unsolicited NAs upon assigning a new IPv6 address to
      its interface.

   o  A router creates a new cache entry upon receiving an unsolicited
      NA from a host.

   The following sections discuss these changes in more detail.

4.1.  Nodes Sending Gratuitous Neighbor Advertisements

   The section 7.2.6 of [RFC4861] discusses using unsolicited Neighbor
   Advertisement to inform node neighbors of the new link-layer address
   quickly.  The same mechanism could be used to notify the node
   neighbors about the new network-layer address as well: the node can




Linkova                  Expires March 19, 2021                 [Page 6]

Internet-Draft                Gratuitous ND               September 2020


   send gratuitous unsolicited Neighbor Advertisements upon assigning a
   new IPv6 address to its interface.

   To minimize the potential disruption in case of duplicate addresses
   the node should not set the Override flag for a preferred address and
   must not set the Override flag if the address is in Optimistic
   [RFC4429] state.

   As the main purpose of sending unsolicited NAs upon configuring a new
   address is to proactively create a Neighbor Cache entry on the first-
   hop routers, the gratuitous NAs are sent to all-routers multicast
   address (ff02::2).  Limiting the recipients to routers only would
   help reduce the multicast noise level.  If the link-layer devices are
   performing MLD snooping [RFC4541] then those unsolicited NAs will be
   only sent to onlink routers instead of being flooded to all nodes.

   It should be noted that the proposed mechanism does not cause any
   significant increase in the multicast traffic.  The additional
   multicast unsolicited NA would proactively create a STALE cache entry
   on routers as discussed below.  When the router receives the return
   traffic flows it does not need to send multicast NSes to the
   solicited node multicast address but would be sending unicast NSes
   instead.  Therefore total amount of multicast traffic should not
   increase.

4.2.  Routers Creating Cache Entries Upon Receiving Unsolicited Neighbor
      Advertisements

   The section 7.2.5 of [RFC4861] states: "When a valid Neighbor
   Advertisement is received (either solicited or unsolicited), the
   Neighbor Cache is searched for the target's entry.  If no entry
   exists, the advertisement SHOULD be silently discarded.  There is no
   need to create an entry if none exists, since the recipient has
   apparently not initiated any communication with the target".

   The reasoning behind dropping unsolicited Neighbor Advertisements
   ("the recipient has apparently not initiated any communication with
   the target") is valid for onlink host-to-host communication but, as
   discussed above, it does not really apply for the scenario when the
   host is announcing its address to routers.  Therefore it would be
   beneficial to allow routers creating new entries upon receiving an
   unsolicited Neighbor Advertisement.

   This document updates [RFC4861] so that routers create a new Neighbor
   Cache entry upon receiving an unsolicited Neighbor Advertisement.
   The proposed changes do not modify routers behaviour specified in
   [RFC4861] for the scenario when the corresponding Neighbor Cache
   entry already exists.



Linkova                  Expires March 19, 2021                 [Page 7]

Internet-Draft                Gratuitous ND               September 2020


5.  Avoiding Disruption

   If nodes following the recommendations in this document are using the
   DAD mechanism defined in [RFC4862], they would send unsolicited NA as
   soon as the address changes the state from tentative to preferred
   (after its uniqueness has been verified).  However nodes willing to
   minimize network stack configuration delays might be using optimistic
   addresses, which means there is a possibility of the address not
   being unique on the link.  The section 2.2 of [RFC4429] discusses
   measures to ensure that ND packets from the optimistic address do not
   override any existing neighbor cache entries as it would cause
   traffic interruption of the rightful address owner in case of address
   conflict.  As nodes willing to speed up their network stack
   configuration are most likely to be affected by the problem outlined
   in this document it seems reasonable for such hosts to advertise
   their optimistic addresses by sending unsolicited NAs.  The main
   question to consider is the potential risk of overriding the cache
   entry for the rightful address owner if the optimistic address
   happens to be duplicated.

   The following sections are discussing the address collision scenario
   when a node sends an unsolicited NA for an address in the Optimistic
   state, while another node has the same address assigned already.

5.1.  Neighbor Cache Entry Exists in Any State Other That INCOMPLETE

   If the router Neighbor Cache entry for the target address already
   exists in any state other than INCOMPLETE, then as per section 7.2.5
   of [RFC4861] an unsolicited NA with the Override flag cleared would
   change the entry state from REACHABLE to STALE but would not update
   the entry in any other way.  Therefore even if the host sends an
   unsolicited NA from the its Optimistic address the router cache entry
   would not be updated with the new Link-Layer address and no impact to
   the traffic for the rightful address owner is expected.

5.2.  Neighbor Cache Entry is in INCOMPLETE state

   Another corner case is the INCOMPLETE cache entry for the address.
   If the host sends an unsolicited NA from the Optimistic address it
   would update the entry with the host link-layer address and set the
   entry to the STALE state.  As the INCOMPLETE entry means that the
   router has started the ND process for the address and the multicast
   NS has been sent, the rightful owner is expected to reply with
   solicited NA with the Override flag set.  Upon receiving a solicited
   NA with the Override flag the cache entry will be updated with the
   TLLA supplied and (as the NA has the Solicited flag set), the entry
   state will be set to REACHABLE.  It would recover the cache entry and
   set the link-layer address to the one of the rightful owner.  The



Linkova                  Expires March 19, 2021                 [Page 8]

Internet-Draft                Gratuitous ND               September 2020


   only potential impact would be for packets arriving to the router
   after the unsolicited NA from the host but before the rightful owner
   responded with the solicited NA.  Those packets would be sent to the
   host with the optimistic address instead of its rightful owner.
   However those packets would have been dropped anyway as until the
   solicited NA is received the router can not send the traffic.

5.3.  Neighbor Cache Entry Does Not Exist

   There are two distinct scenarios which can lead to the situation when
   the router does not have a NC entry for the IPv6 address:

   1.  The rightful owner of the address has not been using it for
       communication.

   2.  The rightful owner just started sending packets from that address
       but the router has not received any return traffic yet.

   The impact on the rightful owner's traffic flows would be different
   in those cases.

5.3.1.  The Rightful Owner Is Not Sending Packets From The Address

   In this scenario the following events are expected to happen:

   1.  The host configures the address and sets its state to Optimistic.

   2.  The host sends an unsolicited NA with the Override flag set to
       zero and starts sending traffic from the Optimistic address.

   3.  The router creates a STALE entry for the address and the host
       link-layer address.

   4.  The host starts DAD and detects the address duplication.

   5.  The router receives the return traffic for the duplicated
       address.  As the NC entry is STALE it sends traffic using that
       entry, changes it to DELAY and wait up to DELAY_FIRST_PROBE_TIME
       ([RFC4861]) seconds.

   6.  The router changes the NC entry state to PROBE and sends up to
       MAX_UNICAST_SOLICIT ([RFC4861]) unicast NSes separated by
       RetransTimer milliseconds ([RFC4861]) to the host link-layer
       address.

   7.  As the host has detected the address conflict already it does not
       respond to the unicast NSes.




Linkova                  Expires March 19, 2021                 [Page 9]

Internet-Draft                Gratuitous ND               September 2020


   8.  The router sends a multicast NS to the solicited node multicast
       address, the rightful owner responds and the router NC entry is
       updated with the rightful owner link-local address.

   The rightful owner is not experiencing any disruption as it does not
   send/receive any traffic.  If after step 7 the router keeps receiving
   any return traffic for communication initiated at step 2, those
   packets would be forwarded to the rightful owner.  However the same
   behaviour would be observed if changes proposed in this document are
   implemented: if the host starts sending packets from its Optimistic
   address but then changed the address state to Duplicated, almost all
   return traffic would be forwarded to the rightful owner of the said
   address.  Therefore it's safe to conclude that the proposed changes
   do not cause any disruption for the rightful owner.

5.3.2.  The Rightful Owner Has Started Sending Packets From The Address

   In this scenario the following events are happening:

   1.  The rightful owner starts sending traffic from the address (e.g.
       the address has just been configured or has not been recently
       used).

   2.  The host configures the address and sets its state to Optimistic.

   3.  The host sends an unsolicited NA with the Override flag set to
       zero and starts sending traffic from the Optimistic address.

   4.  The router creates a STALE entry for the address and the host
       link-layer address.

   5.  The host starts DAD and detects the address duplication.

   6.  The router receives the return traffic flows for both the
       rightful owner of the duplicated address and the new host.  As
       the NC entry is STALE it sends traffic using that entry, changes
       it to DELAY and wait up to DELAY_FIRST_PROBE_TIME ([RFC4861])
       seconds.

   7.  The router changes the NC entry state to PROBE and sends up to
       MAX_UNICAST_SOLICIT ([RFC4861]) unicast NSes separated by
       RetransTimer milliseconds ([RFC4861]) to the host link-layer
       address.

   8.  As the host has detected the address conflict already it does not
       respond to the unicast NSes.





Linkova                  Expires March 19, 2021                [Page 10]

Internet-Draft                Gratuitous ND               September 2020


   9.  The router sends a multicast NS to the solicited node multicast
       address, the rightful owner responds and the router NC entry is
       updated with the rightful owner link-local address.

   As a result the traffic for the address rightful owner would be sent
   to the host with the duplicated address instead.  The duration of the
   disruption can be estimated as DELAY_FIRST_PROBE_TIME*1000 +
   (MAX_UNICAST_SOLICIT - 1)*RetransTimer milliseconds.  As per the
   constants defined in Section 10 of [RFC4861] this interval is equal
   to 5*1000 + (3 - 1)*1000 = 7000ms or 7 seconds.

   However it should be noted that the probability of such scenario is
   rather low as it would require the following things to happen almost
   simultaneously (within tens of milliseconds):

   o  One host starts using a new IPv6 address and sending traffic.

   o  Another host configures the same IPv6 address in Optimistic mode
      before the router receives the return traffic for the first host.

6.  Modifications to RFC-Mandated Behavior

   All normative text in this memo is contained in this section.

6.1.  Modification to RFC4861 Neighbor Discovery for IP version 6 (IPv6)

6.1.1.  Modification to the section 7.2.5

   This document proposes the following changes to the section 7.2.5 of
   [RFC4861]:

   ------------------------------------------------------------------

   OLD TEXT:

   ------------------------------------------------------------------

   When a valid Neighbor Advertisement is received (either solicited or
   unsolicited), the Neighbor Cache is searched for the target's entry.
   If no entry exists, the advertisement SHOULD be silently discarded.
   There is no need to create an entry if none exists, since the
   recipient has apparently not initiated any communication with the
   target.

   ------------------------------------------------------------------

   NEW TEXT:




Linkova                  Expires March 19, 2021                [Page 11]

Internet-Draft                Gratuitous ND               September 2020


   ------------------------------------------------------------------

   When a valid Neighbor Advertisement is received (either solicited or
   unsolicited), the Neighbor Cache is searched for the target's entry.
   If no entry exists, hosts SHOULD silently discard the advertisement.
   There is no need to create an entry if none exists, since the
   recipient has apparently not initiated any communication with the
   target.  Routers SHOULD create a new entry for the target address
   with the link-layer address set to the Target link-layer address
   option (if supplied).  The entry its reachability state MUST also be
   set to STALE.  If the received Neighbor Advertisement does not
   contain the Target link-layer address option the advertisement SHOULD
   be silently discarded.

   ------------------------------------------------------------------

6.1.2.  Modification to the section 7.2.6

   This document proposes the following changes to the section 7.2.6 of
   [RFC4861]:

   OLD TEXT:

   ------------------------------------------------------------------

   Also, a node belonging to an anycast address MAY multicast
   unsolicited Neighbor Advertisements for the anycast address when the
   node's link-layer address changes.

   ------------------------------------------------------------------

   NEW TEXT:

   ------------------------------------------------------------------

   Also, a node belonging to an anycast address MAY multicast
   unsolicited Neighbor Advertisements for the anycast address when the
   node's link-layer address changes.

   A node may also wish to notify its first-hop routers when it
   configures a new global IPv6 address so the routers can proactively
   populate their neighbor caches with the corresponding entries.  In
   such cases a node SHOULD send up to MAX_NEIGHBOR_ADVERTISEMENT
   Neighbor Advertisement messages.  If the address is preferred then
   the Override flag SHOULD NOT be set.  If the address is in the
   Optimistic state then the Override flag MUST NOT be set.  The
   destination address SHOULD be set to the all-routers multicast
   address.  These advertisements MUST be separated by at least



Linkova                  Expires March 19, 2021                [Page 12]

Internet-Draft                Gratuitous ND               September 2020


   RetransTimer seconds.  The first advertisement SHOULD be sent as soon
   as one of the following events happens:

   ------------------------------------------------------------------

   o  if Optimistic DAD [RFC4429] is used: a new Optimistic address is
      assigned to the node interface.

   o  if Optimistic DAD is not used: an address changes the state from
      tentative to preferred.

7.  Solution Limitations

   The solution described in this document provides some improvement for
   a node configuring a new IPv6 address and start sending traffic from
   it.  However that approach does not completely eliminate the scenario
   when a router receives some transit traffic for an address without
   the corresponding Neighbor Cache entry.  For example:

   o  If the host starts using an already configured IPv6 address after
      a long period of inactivity, the router might not have the NC
      entry for that address anymore, as old/expired entries are
      deleted.

   o  Clearing the router Neighbor Cache would trigger the packet loss
      for all actively used addresses removed from the cache.

8.  Solutions Considered but Discarded

   There are other possible approaches to address the problem, for
   example:

   o  Just do nothing.

   o  Migrating from the "reactive" Neighbor Discovery ([RFC4861]) to
      the registration-based mechanisms ([RFC8505]).

   o  Creating new entries in routers Neighbor Cache by gleaning from
      Neighbor Discovery DAD messages.

   o  Initiates bidirectional communication from the host to the router
      using the host GUA.

   o  Making the probing logic on hosts more robust.

   o  Increasing the buffer size on routers.





Linkova                  Expires March 19, 2021                [Page 13]

Internet-Draft                Gratuitous ND               September 2020


   o  Transit dataplane traffic from an unknown address (an address w/o
      the corresponding neighbor cache entry) triggers an address
      resolution process on the router.

   It should be noted that some of those options are already implemented
   by some vendors.  The following sections discuss those approaches and
   the reasons they were discarded.

8.1.  Do Nothing

   One of the possible approaches might be to declare that everything is
   working as intended and let the upper-layer protocols to deal with
   packet loss.  The obvious drawbacks include:

   o  Unhappy users.

   o  Many support tickets.

   o  More resistance to deploy IPv6 and IPv6-Only networks.

8.2.  Change to the Registration-Based Neighbor Discovery

   The most radical approach would be to move away from the reactive ND
   as defined in [RFC4861] and expand the registration-based ND
   ([RFC6775], [RFC8505]) used in Low-Power Wireless Personal Area
   Networks (6LoWPANs) to the rest of IPv6 deployments.  This option
   requires some investigation and discussion.  However the
   implementation complexity and unclear adoption timeline makes this
   approach less preferable than one proposed in this document.

8.3.  Host Sending NS to the Router Address from Its GUA

   The host could force creating a STALE entry for its GUA in the router
   ND cache by sending the following Neighbor Solicitation message:

   o  The NS source address is the host GUA.

   o  The destination address is the default router IPv6 address.

   o  The Source Link-Layer Address option contains the host link-layer
      address.

   o  The target address is the host default router address (the default
      router address the host received in the RA).

   The main disadvantages of this approach are:





Linkova                  Expires March 19, 2021                [Page 14]

Internet-Draft                Gratuitous ND               September 2020


   o  Would not work for Optimistic addresses as section 2.2 of
      [RFC4429] explicitly prohibits sending Neighbor Solicitations from
      an Optimistic Address.

   o  If first-hop redundancy is deployed in the network, the NS would
      reach the active router only, so all backup routers (or all active
      routers except one) would not get their neighbor cache updated.

   o  Some wireless devices are known to alter ND packets and perform
      various non-obvious forms of ND proxy actions.  In some cases,
      unsolicited NAs might not even reach the routers.

8.4.  Host Sending Router Solicitation from its GUA

   The host could send a router solicitation message to 'all routers'
   multicast address, using its GUA as a source.  If the host link-layer
   address is included in the Source Link-Layer Address option, the
   router would create a STALE entry for the host GUA as per the section
   6.2.6 of [RFC4861].  However, this approach can not be used if the
   GUA is in optimistic state: section 2.2 of [RFC4429] explicitly
   prohibits using an Optimistic Address as the source address of a
   Router Solicitation with a SLLAO as it might disrupt the rightful
   owner of the address in the case of a collision.  So for the
   optimistic addresses the host can send an RS without SLLAO included.
   In that case the router may respond with either a multicast or a
   unicast RA (only the latter would create a cache entry).

   This approach has the following drawbacks:

   o  If the address is in the Optimistic state the RS can not contain
      SLLAO.  As a result the router would only create a cache entry if
      solicited RAs are sent as unicast.  Routers sending solicited RAs
      as multicast would not create a new cache entry as they do not
      need to send a unicast packet back to the host.

   o  There might be a random delay between receiving an RS and sending
      a unicast RA back (and creating a cache entry) which might
      undermine the idea of creating the cache entry proactively.

   o  Some wireless devices are known to intercept ND packets and
      perform various non-obvious forms of ND proxy actions.  In some
      cases the RS might not even reach the routers.









Linkova                  Expires March 19, 2021                [Page 15]

Internet-Draft                Gratuitous ND               September 2020


8.5.  Routers Populating Their Caches by Gleaning From Neighbor
      Discovery Packets

   Routers may be able to learn about new addresses by gleaning from the
   DAD Neighbor Solicitation messages.  The router could listen to all
   solicited node multicast address groups and upon receiving a Neighbor
   Solicitation from the unspecified address search its Neighbor Cache
   for the solicitation's Target Address.  If no entry exists, the
   router may create an entry, set its reachability state to
   'INCOMPLETE' and start the address resolution for that entry.

   The same solution was proposed in
   [I-D.halpern-6man-nd-pre-resolve-addr].  Some routing vendors support
   such optimization already.  However, this approach has a number of
   drawbacks and therefore should not be used as the only solution:

   o  Routers need to receive all multicast Neighbor Discovery packets
      which might negatively impact the routers CPU.

   o  If the router starts the address resolution as soon as it receives
      the DAD Neighbor Solicitation the host might be still performing
      DAD and the target address might be tentative.  In that case, the
      host SHOULD silently ignore the received Neighbor Solicitation
      from the router as per the Section 5.4.3 of [RFC4862].  As a
      result the router might not be able to complete the address
      resolution before the return traffic arrives.

8.6.  Initiating Hosts-to-Routers Communication

   The host may force the router to start address resolution by sending
   a data packet such as ping or traceroute to its default router link-
   local address, using the GUA as a source address.  As the RTT to the
   default router is lower than RTT to any off-link destinations it's
   quite likely that the router would start the neighbor discovery
   process for the host GUA before the first packet of the returning
   traffic arrives.

   This approach has the following drawbacks:

   o  Data packets to the router link-local address could be blocked by
      security policy or control plane protection mechanism.

   o  It introduces an additional overhead for routers control plane (in
      addition to processing ND packets, the data packet needs to be
      processed as well).






Linkova                  Expires March 19, 2021                [Page 16]

Internet-Draft                Gratuitous ND               September 2020


   o  Unless the data packet is sent to 'all routers' ff02::2 multicast
      address, if the network provides a first-hop redundancy then only
      the active router would create a new cache entry.

8.7.  Making the Probing Logic on Hosts More Robust

   Theoretically the probing logic on hosts might be modified to deal
   better with initial packet loss.  For example, only one probe can be
   sent or probes retransmit intervals can be reduced.  However, this
   approach has a number of drawbacks:

   o  It would require updating all possible applications performing
      probing, while the proposed solution is implemented on operating
      systems level.

   o  Some implementations need to send multiple probes.  Examples are
      including but not limited to:

      *  Sending AAAA and A records DNS probes in parallel.

      *  Detecting captive portals often require sending multiple
         packets.

   o  While it would increase the probability of the probing to complete
      successfully, there are multiple cases when packet loss would
      still occur:

      *  The probe response consists of multiple packets, so all but the
         first one are dropped.

      *  There are multiple applications on the same host sending
         traffic and return packets arrive simultaneously.

      *  There are multiple first-hop routers in the network.  The first
         probe packet creates the NC entry on one of them.  The
         subsequent return traffic flows might cross other routers and
         still experince the issue.

8.8.  Increasing the Buffer Size on Routers

   Increasing the buffer size and buffering more packets would
   exacerbate issues described in [RFC6583] and make the router more
   vulnerable to ND-based denial of service attacks.








Linkova                  Expires March 19, 2021                [Page 17]

Internet-Draft                Gratuitous ND               September 2020


8.9.  Transit Dataplane Traffic From a New Address Triggering Address
      Resolution

   When a router receives a transit packet, it might check the presence
   of the neighbor cache entry for the packet source address and if the
   entry does not, exist start address resolution process.  This
   approach does ensure that a Neighbor Cache entry is proactively
   created every time a new, previously unseen GUA is used for sending
   offlink traffic.  However this approach has a number of limitations,
   in particular:

   o  If traffic flows are asymmetrical the return traffic might not
      transit the same router as the original traffic which triggered
      the address resolution.  So the neighbor cache entry is created on
      the "wrong" router, not the one which actually needs the neighbor
      cache entry for the host address.

   o  The functionality needs to be limited to explicitly configured
      networks/interfaces, as the router needs to distinguish between
      onlink addresses (ones the router needs to have Neighbor Cache
      entries for) and the rest of the address space.

   o  Implementing such functionality is much more complicated than all
      other solutions as it would involve complex data-control planes
      interaction.

9.  IANA Considerations

   This memo asks the IANA for no new parameters.

10.  Security Considerations

   One of the potential attack vectors to consider is a cache spoofing
   when the attacker might try to install a cache entry for the victim's
   IPv6 address and the attacker's Link-Layer address.  However it
   should be noted that this document does not propose any changes for
   the scenario when the ND cache for the given IPv6 address already
   exists.  Therefore it is not possible for the attacker to override
   any existing cache entry.

   A malicious host could attempt to exhaust the neighbor cache on the
   router by creating a large number of STALE entries.  However this
   attack vector is not new and this document does not increase the risk
   of such an attack: the attacker could do it, for example, by sending
   a NS or RS packet with SLLAO included.  All recommendations from
   [RFC6583] still apply.





Linkova                  Expires March 19, 2021                [Page 18]

Internet-Draft                Gratuitous ND               September 2020


   Announcing a new address to all-routers multicast address may inform
   an on-link attacker about IPv6 addresses assigned to the host.
   However hiding information about the specific IPv6 address should not
   be considered a security measure as such information is usually
   disclosed via DAD to all nodes anyway.  Network administrators can
   also mitigate this issue by enabling MLD snooping on the link-layer
   devices to prevent IPv6 link-local multicast packets being flooded to
   all onlink nodes.  If peer-to-peer onlink communications are not
   desirable for the given network segment they should be prevented by
   proper layer2 security mechanisms.  Therefore the risk of allowing
   hosts to send unsolicited Neighbor Advertisements to all-routers
   multicast address is low.

   It should be noted that the proposed mechanism allows hosts to
   proactively inform their routers about global IPv6 addresses existing
   on-link.  Routers could use that information to distinguish between
   used and unused addresses to mitigate ND cache exhaustion DoS attacks
   described in Section 4.3.2 [RFC3756] and [RFC6583].

11.  Acknowledgements

   Thanks to the following people (in alphabetical order) for their
   comments, review and feedback: Mikael Abrahamsson, Stewart Bryant,
   Lorenzo Colitti, Owen DeLong, Igor Gashinsky, Fernando Gont, Tatuya
   Jinmei, Erik Kline, Warren Kumari, Barry Leiba, Jordi Palet Martinez,
   Erik Nordmark, Michael Richardson, Mark Smith, Dave Thaler, Pascal
   Thubert, Loganaden Velvindron, Eric Vyncke.

12.  References

12.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC4291]  Hinden, R. and S. Deering, "IP Version 6 Addressing
              Architecture", RFC 4291, DOI 10.17487/RFC4291, February
              2006, <https://www.rfc-editor.org/info/rfc4291>.

   [RFC4429]  Moore, N., "Optimistic Duplicate Address Detection (DAD)
              for IPv6", RFC 4429, DOI 10.17487/RFC4429, April 2006,
              <https://www.rfc-editor.org/info/rfc4429>.







Linkova                  Expires March 19, 2021                [Page 19]

Internet-Draft                Gratuitous ND               September 2020


   [RFC4861]  Narten, T., Nordmark, E., Simpson, W., and H. Soliman,
              "Neighbor Discovery for IP version 6 (IPv6)", RFC 4861,
              DOI 10.17487/RFC4861, September 2007,
              <https://www.rfc-editor.org/info/rfc4861>.

   [RFC4862]  Thomson, S., Narten, T., and T. Jinmei, "IPv6 Stateless
              Address Autoconfiguration", RFC 4862,
              DOI 10.17487/RFC4862, September 2007,
              <https://www.rfc-editor.org/info/rfc4862>.

   [RFC6775]  Shelby, Z., Ed., Chakrabarti, S., Nordmark, E., and C.
              Bormann, "Neighbor Discovery Optimization for IPv6 over
              Low-Power Wireless Personal Area Networks (6LoWPANs)",
              RFC 6775, DOI 10.17487/RFC6775, November 2012,
              <https://www.rfc-editor.org/info/rfc6775>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8305]  Schinazi, D. and T. Pauly, "Happy Eyeballs Version 2:
              Better Connectivity Using Concurrency", RFC 8305,
              DOI 10.17487/RFC8305, December 2017,
              <https://www.rfc-editor.org/info/rfc8305>.

   [RFC8505]  Thubert, P., Ed., Nordmark, E., Chakrabarti, S., and C.
              Perkins, "Registration Extensions for IPv6 over Low-Power
              Wireless Personal Area Network (6LoWPAN) Neighbor
              Discovery", RFC 8505, DOI 10.17487/RFC8505, November 2018,
              <https://www.rfc-editor.org/info/rfc8505>.

12.2.  Informative References

   [I-D.halpern-6man-nd-pre-resolve-addr]
              Chen, I. and J. Halpern, "Triggering ND Address Resolution
              on Receiving DAD-NS", draft-halpern-6man-nd-pre-resolve-
              addr-00 (work in progress), January 2014.

   [RFC3756]  Nikander, P., Ed., Kempf, J., and E. Nordmark, "IPv6
              Neighbor Discovery (ND) Trust Models and Threats",
              RFC 3756, DOI 10.17487/RFC3756, May 2004,
              <https://www.rfc-editor.org/info/rfc3756>.

   [RFC4541]  Christensen, M., Kimball, K., and F. Solensky,
              "Considerations for Internet Group Management Protocol
              (IGMP) and Multicast Listener Discovery (MLD) Snooping
              Switches", RFC 4541, DOI 10.17487/RFC4541, May 2006,
              <https://www.rfc-editor.org/info/rfc4541>.



Linkova                  Expires March 19, 2021                [Page 20]

Internet-Draft                Gratuitous ND               September 2020


   [RFC4941]  Narten, T., Draves, R., and S. Krishnan, "Privacy
              Extensions for Stateless Address Autoconfiguration in
              IPv6", RFC 4941, DOI 10.17487/RFC4941, September 2007,
              <https://www.rfc-editor.org/info/rfc4941>.

   [RFC6583]  Gashinsky, I., Jaeggli, J., and W. Kumari, "Operational
              Neighbor Discovery Problems", RFC 6583,
              DOI 10.17487/RFC6583, March 2012,
              <https://www.rfc-editor.org/info/rfc6583>.

Author's Address

   Jen Linkova
   Google
   1 Darling Island Rd
   Pyrmont, NSW  2009
   AU

   Email: furry@google.com
































Linkova                  Expires March 19, 2021                [Page 21]
